//CREATE TABLE учебное_занятие
//        (
//        id_учебного_занятия            SERIAL PRIMARY KEY,
//        аудитория                      VARCHAR(8) NOT NULL,
//        преподаватель                  VARCHAR(64) NOT NULL,
//        тип                            lesson_type_enum,
//        id_активности                  INTEGER NOT NULL REFERENCES активность ON DELETE CASCADE
//        );

//String.format( "INSERT INTO \"учебное_занятие\" (\"аудитория\",\"преподаватель\", \"тип\", \"id_активности\") " +
//        "VALUES (\'%s\', \'%s\', \'%s\', \'%s\');\n" , )


// если занятие дистанционное, то аудитория не указывается
// если аудитория 4х значная, то корпус - ломоносова

public class Lesson {
    static String[] rooms = {"","422","466","375","324","1310"};
    static String[] teachers = {"Тропченко А.Ю", "Клименков С.В", "Ососкова М.И", "Балканский А.А", "Перл И.А",
            "Осипов С.В", "Болдырева Е.А", "Николаев В.В", "Харитонова А.Е", "Бессмертный И.А",
            "Малышева Т.А", "Балакшин П.В", "Поляков В.И", "Тертычный В.Ю", "Письмак А.Е" };
    static String[] type = {"лекция", "практика"};
    static int[] activityID;
}
